# GeometryObject Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GeometryObject Class
Members See Also
---
The common base class for all geometric primitives.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class GeometryObject : APIObject
```

Visual Basic
---
```text
Public Class GeometryObject _
	Inherits APIObject
```

Visual C++
---
```text
public ref class GeometryObject : public APIObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..GeometryObject Autodesk.Revit.DB..::..Curve Autodesk.Revit.DB..::..Edge Autodesk.Revit.DB..::..Face Autodesk.Revit.DB..::..GeometryElement Autodesk.Revit.DB..::..GeometryInstance Autodesk.Revit.DB..::..Mesh Autodesk.Revit.DB..::..Point Autodesk.Revit.DB..::..PolyLine Autodesk.Revit.DB..::..Profile Autodesk.Revit.DB..::..Solid
# See Also
GeometryObject Members
Autodesk.Revit.DB Namespace